---
kind: method
id: M:Autodesk.Revit.DB.Mechanical.DuctSizeIterator.Reset
source: html/2af60cf4-5cb1-7bf9-14d0-06a627ad8749.htm
---
# Autodesk.Revit.DB.Mechanical.DuctSizeIterator.Reset Method

Resets the iterator to the initial state.

## Syntax (C#)
```csharp
public virtual void Reset()
```